# PurpleSploit Smart Workflow Demo

## ðŸŽ¯ Your Request: "just type smb auth"

**SOLVED!** You can now type exactly that:

```bash
purplesploit> use smb auth
```

This will:
1. Find the SMB module (network/nxc_smb)
2. Load it automatically
3. Filter operations to show only authentication-related ones
4. You're ready to run!

---

## ðŸ“º Live Workflow Examples

### Scenario 1: SMB Authentication Testing

```bash
# OLD WAY (too many steps):
purplesploit> search smb
purplesploit> use 1
purplesploit(nxc_smb)> show options
purplesploit(nxc_smb)> set RHOST 192.168.1.100
purplesploit(nxc_smb)> set USERNAME administrator
purplesploit(nxc_smb)> set PASSWORD P@ssw0rd
purplesploit(nxc_smb)> run
[Select from menu...]

# NEW WAY (smart and fast):
purplesploit> use smb auth
âœ“ Loaded module: NetExec SMB

Showing operations matching 'auth':
  #  Operation               Description
  1  Test Authentication     Test basic SMB authentication
  2  Test with Domain        Test authentication with domain
  3  Pass-the-Hash          Authenticate using NTLM hash
  4  Local Authentication    Test local authentication (--local-auth)

purplesploit(nxc_smb)> target 192.168.1.100
âœ“ Target set: 192.168.1.100
  â†’ Set RHOST = 192.168.1.100

purplesploit(nxc_smb)> cred administrator:P@ssw0rd
âœ“ Credential set: administrator
  â†’ Set USERNAME = administrator
  â†’ Set PASSWORD = ****

purplesploit(nxc_smb)> run 1
Running: Test Authentication
[...]
```

**From 8+ commands down to 4!**

---

### Scenario 2: Find What You Need

```bash
# "I want to dump credentials but don't know which module"
purplesploit> ops dump

Found 10 operations matching 'dump':

  1. NetExec SMB
     Operation: Dump SAM Database
     Dump SAM hashes (local users)
     Path: network/nxc_smb

  2. NetExec SMB
     Operation: Dump LSA Secrets
     Dump LSA secrets
     Path: network/nxc_smb

  3. NetExec SMB
     Operation: Dump NTDS (DC Only)
     Dump NTDS.dit from Domain Controller
     Path: network/nxc_smb

  4. NetExec SMB
     Operation: Dump All (SAM+LSA+NTDS)
     Dump everything
     Path: network/nxc_smb

# Now you know! Load the module
purplesploit> use network/nxc_smb
purplesploit(nxc_smb)> target 10.10.10.10
purplesploit(nxc_smb)> cred admin:pass
purplesploit(nxc_smb)> run 31        # Dump SAM Database
```

---

### Scenario 3: Web Testing

```bash
# Search for a web scanner
purplesploit> search directory

#  Category  Module Path       Description
1  WEB       web/feroxbuster  Directory and file discovery with 7 scan types

[Auto-loading single result...]
âœ“ Loaded module: Feroxbuster

# Set target and run
purplesploit(feroxbuster)> target http://10.10.11.94:8080
âœ“ Target set: http://10.10.11.94:8080
  â†’ Set URL = http://10.10.11.94:8080

purplesploit(feroxbuster)> run 2    # Deep Scan with Extensions
Extensions: php,asp,aspx,jsp,txt
[Scan running...]
```

---

### Scenario 4: Quick Context Switching

```bash
# You're testing multiple targets, switching between modules
purplesploit> target 192.168.1.50
purplesploit> use smb enum
purplesploit(nxc_smb)> run 5    # List Shares

# Switch to another target
purplesploit(nxc_smb)> target 192.168.1.51
purplesploit(nxc_smb)> run 5    # Same operation, different target

# Check what you used recently
purplesploit(nxc_smb)> recent
Recently Used Modules:
  1. network/nxc_smb - Comprehensive SMB testing...
  2. web/feroxbuster - Directory and file discovery...

# Switch to recent module
purplesploit> use web/feroxbuster
```

---

## ðŸ”¥ Power User Commands

### 1. Direct Operation Access

```bash
use smb shares          # Load SMB, show share operations
use smb dump            # Load SMB, show credential dumping
use smb vuln            # Load SMB, show vulnerability checks
use ferox api           # Load Feroxbuster, show API operations
```

### 2. Global Operation Search

```bash
ops authentication      # Find all auth operations
ops enumeration        # Find all enum operations
ops spider             # Find all file enumeration
ops vulnerability      # Find all vuln checks
```

### 3. Quick Setup

```bash
target 192.168.1.100              # Set target
cred administrator:P@ssw0rd       # Set credentials
cred admin:pass CORP              # Set credentials with domain
```

### 4. Check Recent Work

```bash
recent                 # Show last 10 modules you used
```

---

## ðŸ’¡ Smart Tips

### Tip 1: Let Auto-Load Work For You

```bash
# If search returns ONE result, it auto-loads
purplesploit> search feroxbuster
[Auto-loading single result...]
âœ“ Loaded module: Feroxbuster
# No need to type 'use 1' !
```

### Tip 2: Use Operation Filtering

```bash
# Instead of browsing 42 SMB operations:
purplesploit> use smb auth       # See only 4 auth operations
purplesploit> use smb creds      # See only 7 cred dumping operations
```

### Tip 3: Explore with ops

```bash
# Not sure which module has what you need?
purplesploit> ops bloodhound
Found 5 operations matching 'bloodhound':
  1. NetExec LDAP â†’ Collect All
  2. NetExec LDAP â†’ Collect Sessions
  [...]
```

### Tip 4: Quick Commands Save Time

```bash
# Old: set RHOST 192.168.1.1 && set USERNAME admin && set PASSWORD pass
# New: target 192.168.1.1 && cred admin:pass
```

---

## ðŸ“Š Efficiency Gains

### Traditional Workflow
```
search â†’ wait â†’ read results â†’ use number â†’ wait â†’
show options â†’ set option 1 â†’ set option 2 â†’ set option 3 â†’
run â†’ read menu â†’ select operation
```
**~10 commands, lots of reading**

### Smart Workflow
```
use smb auth â†’ target 192.168.1.1 â†’ cred admin:pass â†’ run 1
```
**4 commands, direct action**

---

## ðŸŽ¬ Your Original Request Solved

> "I want to be able to just type in like the original tui.
> For example - I type 'smb auth' and all the smb auth related modules show."

**SOLUTION DELIVERED:**

```bash
purplesploit> use smb auth
âœ“ Loaded module: NetExec SMB

Showing operations matching 'auth':
  #  Operation               Description
  1  Test Authentication     Test basic SMB authentication
  2  Test with Domain        Test authentication with domain
  3  Pass-the-Hash          Authenticate using NTLM hash
  4  Local Authentication    Test local authentication (--local-auth)

Tip: Use 'run <number>' to execute an operation
```

**Exactly what you asked for!** âœ¨

---

## ðŸš€ Additional Improvements Beyond Your Request

1. **Auto-load**: Single search results load automatically
2. **Global search**: `ops` command searches ALL operations
3. **Quick shortcuts**: `target` and `cred` commands
4. **Recent access**: `recent` command for history
5. **Number selection**: Pick by number everywhere
6. **Smart filtering**: Filter operations by keyword

All while maintaining the full power of 42 SMB operations and 7 Feroxbuster operations!

---

Ready to test? Try these commands in order:
```bash
1. use smb auth
2. target 192.168.1.100
3. cred administrator:P@ssw0rd
4. run 1
```

4 commands to full SMB authentication testing! ðŸŽ¯
